ode-soap-performance/bpelContent/Addition.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Addition/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.wscomposition.org/Addition/" name="Addition">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.wscomposition.org/Addition/" schemaLocation="Addition.xsd"></xsd:import>
        </xsd:schema>
    </types>

    <message name="SubstractRequest">
        <part name="firstParam" type="xsd:double"></part>
        <part name="secondParam" type="xsd:double"></part>
    </message>
    <message name="SubstractRequestResponse">
        <part name="return" type="tns:additionResponse"></part>
    </message>
    <message name="AddRequest">
        <part name="firstParam" type="xsd:double"></part>
        <part name="secondParam" type="xsd:double"></part>
    </message>
    <message name="AddRequestResponse">
        <part name="return" type="tns:additionResponse"></part>
    </message>
    <portType name="AdditionServiceImpl">
        <operation name="SubstractRequest" parameterOrder="firstParam secondParam">
            <input wsam:Action="http://www.wscomposition.org/Addition/AdditionServiceImpl/SubstractRequestRequest" message="tns:SubstractRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/Addition/AdditionServiceImpl/SubstractRequestResponse" message="tns:SubstractRequestResponse"></output>
        </operation>
        <operation name="AddRequest" parameterOrder="firstParam secondParam">
            <input wsam:Action="http://www.wscomposition.org/Addition/AdditionServiceImpl/AddRequestRequest" message="tns:AddRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/Addition/AdditionServiceImpl/AddRequestResponse" message="tns:AddRequestResponse"></output>
        </operation>
    </portType>
    <binding name="AdditionSOAPBinding" type="tns:AdditionServiceImpl">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
        <operation name="SubstractRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Addition/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Addition/"></soap:body>
            </output>
        </operation>
        <operation name="AddRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Addition/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Addition/"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="Addition">
        <port name="AdditionSOAP" binding="tns:AdditionSOAPBinding">
            <soap:address location="http://localhost:9000/Addition"></soap:address>
        </port>
    </service>
</definitions>