mule-soap-performance/target/classes/SubstractRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.wscomposition.org/Addition/">
   <soapenv:Header/>
   <soapenv:Body>
      <add:SubstractRequest>
         <firstParam></firstParam>
         <secondParam></secondParam>
      </add:SubstractRequest>
   </soapenv:Body>
</soapenv:Envelope>